Revit 2024 API
FabricationNetworkChangeService.ChangeService Method
Overload List
Name | Description
ChangeService(ISet<ElementId>, Int32, Int32)
 Changes the service of the selection of fabrication parts.
ChangeService(ISet<ElementId>, Int32, Int32, Boolean)
 Changes the service of the selection of fabrication parts.
See Also
FabricationNetworkChangeService Class
FabricationNetworkChangeService Members
Autodesk.Revit.DB.Fabrication Namespace